{
    "vlabs": {
        "title": "Virtual Labs",
        "description": "Making Engineering Education Engaging, Enjoyable, Immersive and Online",
        "content": "The Virtual Labs project, which was established in 2009, represents a significant initiative of the Ministry of Education, Government of India. This innovative program, poised to drive a meaningful change in education and research in India, provides a platform for interactive learning through experiments.\n\nAmong the key groups targeted are students and faculty members of science and engineering colleges, who may lack access to high-quality laboratory facilities and equipment. Additionally, high school students are encouraged to explore their curiosity through the program, potentially inspiring them to pursue further studies in these fields.\n\nThe Virtual Labs project also seeks to create a network of researchers across different institutes, who can collaborate and share resources, thereby promoting the exchange of knowledge and ideas. Importantly, the project's content and teaching resources are designed to benefit engineering colleges and other institutions, making it a highly inclusive and impactful initiative.\n"
    },
    "vlead": {
        "title": "Virtual Labs Engineering and Architecture Design",
        "description": "A Platform for Hands-On Learning in Engineering and Architecture",
        "content": "Launched in 2019, we are the Virtual Labs Engineering and Architecture Design (VLEAD) project, offering interactive virtual experiments and simulations in engineering and architecture. Our platform enhances practical skills, problem-solving abilities, and fosters collaboration among students, faculty, and researchers."
    },
    "stats": {
        "time": "Jan 2020 - Feb 2024",
        "labs": 176,
        "disciplines": 15,
        "pageviews": "93.5 million",
        "users": "14.6 million"
    },
    "phases": [
        {
            "phase": "Phase-1",
            "years": "2009 - 2013",
            "description": "Development of 27 Labs\n260 experiments across 4 domains\nOutreach Workshops"
        },
        {
            "phase": "Phase-2",
            "years": "2014 - 2017",
            "description": "Virtual Labs Platform on Open edX\nFOSS Conversion Methodology\nCentralized Integration Platform\nLab Hosting on Central Cloud\nPerformance Enhancements\nVersion Control on GitHub\nSecurity Enhancements\nIntegration Workshops\nLab Development Kits\nMaintenance of Labs\nOutreach Portal"
        },
        {
            "phase": "Phase-3",
            "years": "2018 - 2020",
            "description": "Centralized Analytics Reporting\nDevelopment of 2 CS Labs - 23 Data Structures experiments\nFOSS Conversion of 26 Labs\nAutomated Network Clusters\nPerformance Enhancements\nSecurity Enhancements\nPilot Translation of 2 Labs - Translated into Hindi & Telugu\nSummer/Winter/Remote Internships\nUniform UI across labs\nDeveloper Workshops\nMaintenance of Labs"
        },
        {
            "phase": "Ext-Phase-3",
            "years": "2021 - 2026",
            "description": "Development of 16 Labs - Year 1 & 2\n140 experiments across 4 domains\nAutomated Lab Deployment Tool\nEnhanced Cloud Architecture\nCommon Developer Tools\nVirtual Labs Mobile App"
        }
    ],
    "initiatives": [
        "VS Code Web Extension - To streamline and simplify the experiment development process and tasks such as cloning, building, running validations, and deploy locally for testing purposes.",
        "Question Bank Service - To create a centralized repository of multiple-choice questions that can be accessed and contributed to by authorized users.",
        "Content Management System - To create a web-based system built over Netlify CMS to facilitate the creation of virtual experiment. A interface that eliminates the need for users to have prior knowledge of Git and Markdown.",
        "Content/Config/Code Validation Tool - To validate code and content while developing the experiments.",
        "PWA App - To provide a seamless look and feel, a mobile-compatible PWA and a native android app have using MUI Joy in combination with React, which allows users to filter and search for experiments.",
        "Content Rating Tool - To display each experiment's rating and capture them on Google Analytics.",
        "Coding Platform - To add a programming interface to experiments. To begin with the interface will allow the users to write basic code in all the Data Structure experiments.",
        "Offline Functionality -To allow the offline use of mobile application by implementing caching feature."
    ]
}