{
    "roles":[
        {
            "role":"default",
            "about":"This site operates based on three major roles: Learner, Educator and Creator. Based on your role, you will be presented with functions that are more appropriate for your use of this site. You can always change your role later!",
            "id":"default"
        },
        {
            "role":"learner",
            "about":"The role of the learner is simply to learn new concepts by studying and simulating any of the existing experiments in any of the labs. Scroll down or check out the navigation bar above to get started!",
            "id":"learner-text"
        },
        {
            "role":"educator",
            "about":"The role of the educator is to use Virtual Labs as a platform to simulate experiments as an aid to classroom teaching. Also, an educator can collaborate through the outreach programs.",
            "id":"educator-text"
        },
        {
            "role":"creater",
            "about":"The role of the creator is to contribute to Virtual Labs by developing new experiments under laboratories or otherwise. Development and hosting guidelines can be found on our Hosting Info page.",
            "id":"creator-text"
        }
    ],
    "domains":[
        {
            "title":"Computer Science and Engineering",
            "img":"cards/Comp.png",
            "href":""
        },
        {
            "title":"Mechanical",
            "img":"cards/Mech.png",
            "href":""
        },
        {
            "title":"Chemical Engineering",
            "img":"cards/ChemEngg.png",
            "href":""
        },
        {
            "title":"Electronics and Comm. Engineering",
            "img":"cards/ElCom.png",
            "href":""
        },
        {
            "title":"Biotechnology",
            "img":"cards/Biotech.png",
            "href":""
        },
        {
            "title":"Electrical Engineering",
            "img":"cards/Elec.png",
            "href":""
        },
        {
            "title":"Chemical Science",
            "img":"cards/Chem.png",
            "href":""
        },
        {
            "title":"Physical Sciences",
            "img":"cards/Phys.png",
            "href":""
        },
        {
            "title":"Civil Engineering",
            "img":"cards/Civil.png",
            "href":""
        }
    ],
    "services":[
        {
            "title":"Development and Hosting",
            "href":"/app-vlead-web/development/",
            "img":"cards/development.webp",
            "body":""
        },
        {
            "title":"Outreach",
            "href":"/app-vlead-web/outreach/",
            "img":"cards/research.webp",
            "body":""
        },
        {
            "title":"FAQ's",
            "href":"/app-vlead-web/faq_page/",
            "img":"cards/FAQs.webp",
            "body":""
        }
    ],
    "shorty": "The Virtual Labs Engineering, Architecture, and Design (VLEAD)  Team at IIIT Hyderabad is a dedicated group responsible for managing and optimizing the operations of  Virtual Labs. We handle various tasks, including infrastructure management, system administration, user interface design, process coordination, analytics, automation, performance and security enhancements, content authoring tool development, and technology research. Our efforts ensure efficient and improved functioning of Virtual Labs, providing users with a seamless learning experience."
}